## Configuración de PANDAS y su importación

In [3]:
# Instalar pandas
#!pip install pandas
import pandas as pd

### Crear una serie a partir de una lista

In [12]:
carros = ['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Ferrari']

In [14]:
# Crear una serie
pd.Series(carros)

0    Challenger
1        Toyota
2         Mazda
3           KIA
4    Mitsubishi
5       Ferrari
dtype: object

### Crear un DataFrame a partir de unna lista de diccionarios (Json)

In [22]:
datos = [
    {"nombre": 'Jetta Variant', "Motor": 'Motor 4.0 Turbo', "Year": 2020, "Kilometraje": 44410.0, "Cero_Km": False, "Valor": 120000},
    {"nombre": 'Camaro', "Motor": 'Motor 4.54 LS', "Year": 2022, "Kilometraje": 10410.0, "Cero_Km": False, "Valor": 480000},
    {"nombre": 'Challenger', "Motor": 'Motor 4.3 Turbo', "Year": 2025, "Kilometraje": 0.0, "Cero_Km": True, "Valor": 680000},
    {"nombre": 'Audi 8 Spider', "Motor": 'Motor 8.0', "Year": 2032, "Kilometraje": 0.0, "Cero_Km": True, "Valor": 4450000},
]

In [24]:
dataset = pd.DataFrame(datos)
dataset

          nombre            Motor  Year  Kilometraje  Cero_Km    Valor
0  Jetta Variant  Motor 4.0 Turbo  2020      44410.0    False   120000
1         Camaro    Motor 4.54 LS  2022      10410.0    False   480000
2     Challenger  Motor 4.3 Turbo  2025          0.0     True   680000
3  Audi 8 Spider        Motor 8.0  2032          0.0     True  4450000

In [26]:
# Nombre de las columnas
dataset.columns.values

array(['nombre', 'Motor', 'Year', 'Kilometraje', 'Cero_Km', 'Valor'],
      dtype=object)

In [32]:
# Mostrar las primeras 3 columnas
dataset.columns.values[:3]

array(['nombre', 'Motor', 'Year'], dtype=object)

In [34]:
# Mostrar la ultima columna
dataset.columns.values[-1]

'Valor'

### Cambair el orden en que se muetran las columnas

In [37]:
dataset[['nombre', 'Valor','Motor', 'Year', 'Kilometraje', 'Cero_Km']]

          nombre    Valor            Motor  Year  Kilometraje  Cero_Km
0  Jetta Variant   120000  Motor 4.0 Turbo  2020      44410.0    False
1         Camaro   480000    Motor 4.54 LS  2022      10410.0    False
2     Challenger   680000  Motor 4.3 Turbo  2025          0.0     True
3  Audi 8 Spider  4450000        Motor 8.0  2032          0.0     True

### Cambiar el nombre de las columnas

In [48]:
dataset = dataset.rename(columns = {
    "nombre": 'Name', 
    "Motor": 'Engine',
    "Year": 'Year', 
    "Kilometraje": 'Mileage',
    "Cero_Km": 'Zero_ml', 
    "Valor": 'Price'
})
dataset

            Name           Engine  Year  Mileage  Zero_ml    Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False   120000
1         Camaro    Motor 4.54 LS  2022  10410.0    False   480000
2     Challenger  Motor 4.3 Turbo  2025      0.0     True   680000
3  Audi 8 Spider        Motor 8.0  2032      0.0     True  4450000

### Seleciconar columnas

In [85]:
dataset["Engine"]

            Engine
0  Motor 4.0 Turbo
1    Motor 4.54 LS
2  Motor 4.3 Turbo
3        Motor 8.0

In [87]:
dataset[["Name", "Price"]]

            Name    Price
0  Jetta Variant   120000
1         Camaro   480000
2     Challenger   680000
3  Audi 8 Spider  4450000

### Mostrar las primeras 2 filas

In [94]:
dataset.head(2)

            Name           Engine  Year  Mileage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False  120000
1         Camaro    Motor 4.54 LS  2022  10410.0    False  480000

### Como ver las ultimas filas

In [97]:
dataset.tail(2)

            Name           Engine  Year  Mileage  Zero_ml    Price
2     Challenger  Motor 4.3 Turbo  2025      0.0     True   680000
3  Audi 8 Spider        Motor 8.0  2032      0.0     True  4450000

### Como obtener un resumen del dataset

In [100]:
dataset.describe()

              Year       Mileage         Price
count     4.000000      4.000000  4.000000e+00
mean   2024.750000  13705.000000  1.432500e+06
std       5.251984  21050.004751  2.024967e+06
min    2020.000000      0.000000  1.200000e+05
25%    2021.500000      0.000000  3.900000e+05
50%    2023.500000   5205.000000  5.800000e+05
75%    2026.750000  18910.000000  1.622500e+06
max    2032.000000  44410.000000  4.450000e+06

### Seleccionar lineas (datos)

In [118]:
# Mostrar las primeras 2 filas
dataset[:2]

            Name           Engine  Year  Mileage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False  120000
1         Camaro    Motor 4.54 LS  2022  10410.0    False  480000

In [114]:
# Mostrar las ultimas 2 filas
dataset[-2:]

            Name           Engine  Year  Mileage  Zero_ml    Price
2     Challenger  Motor 4.3 Turbo  2025      0.0     True   680000
3  Audi 8 Spider        Motor 8.0  2032      0.0     True  4450000

### Utilizar (.loc) para secciones

In [123]:
# Elemento con un indec 3
dataset.loc[3]

Name       Audi 8 Spider
Engine         Motor 8.0
Year                2032
Mileage              0.0
Zero_ml             True
Price            4450000
Name: 3, dtype: object

In [131]:
# Mostrar los elementos de los indices 1 y 2
dataset.loc[[1,3,0,3]]

            Name           Engine  Year  Mileage  Zero_ml    Price
1         Camaro    Motor 4.54 LS  2022  10410.0    False   480000
3  Audi 8 Spider        Motor 8.0  2032      0.0     True  4450000
0  Jetta Variant  Motor 4.0 Turbo  2020  44410.0    False   120000
3  Audi 8 Spider        Motor 8.0  2032      0.0     True  4450000

In [137]:
# Mostrar el nombre y el precio
dataset.loc[: ,['Name', 'Price']]

            Name    Price
0  Jetta Variant   120000
1         Camaro   480000
2     Challenger   680000
3  Audi 8 Spider  4450000

In [141]:
dataset.loc[1:2 ,['Name', 'Price']]

         Name   Price
1      Camaro  480000
2  Challenger  680000